common/models/AdminRole.php

SELECT * FROM `admin_role` WHERE id = 1
---
    public function getRoleInfo($id = 0)
    {
        if ($id == 0){
            $role_obj = new AdminRole();
            return $role_obj->find()
            ->where("id <> 1")
            ->asArray()
            ->all();
        }else{
            $role_obj = new AdminRole();
            return $role_obj->find()
            ->where("id = ".$id)
            ->asArray()
            ->one();