backend/models/VehicleManage.php

SELECT `id`, `username` FROM `user` WHERE status = 1 and role <> 1
---
    public function UserList()
    {
        $res = $this->getUserObj()->find()->select("id,username")->where("status = 1 and role <> 1")->asArray()->all();

SELECT * FROM `vehicle`
---
    public function vehicleList()
    {
        $res = $this->getVehicle()->find()->asArray()->all();

INSERT INTO `driving_record` (`vehicle_id`, `driver`, `start_kilometer`, `end_kilometer`, `gasoline`, `start_at`, `end_at`) VALUES (2, 3, 222, 333, 32, 1490615794, 1490615795)
---
    public function AddRecord($data)
    {
        $record_obj = new DrivingRecord();
        foreach ($data as $k => $v){
            $record_obj->$k = $v;
        }
        return $record_obj->save();