common/helpers/CurrentMenu.php

SELECT * FROM `admin_menu` WHERE `parent_id`=0
---
    public static function getAllChildMenu($menu_id = 0)
    {
        $menu_obj = new AdminMenu();
        $menu_res_arr = array();
        $menu_arr = $menu_obj->find()->where(['parent_id' => $menu_id])->asArray()->all();